
{{alias}}( x )
    Evaluates the natural exponential function (single-precision).

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( 4.0 )
    54.598148345947266
    > y = {{alias}}( -9.0 )
    0.00012340980174485594
    > y = {{alias}}( 0.0 )
    1.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

